In [1]:
import numpy as np
import pandas as pd

In [6]:
titan_df =  pd.read_csv('train.csv') # assing (할당) // declare (선언)

In [8]:
titan_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [11]:
# 데이터 기술 통계량 확인
titan_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [13]:
titan_df.Pclass.value_counts()

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [15]:
titan_df.groupby(by = 'Pclass').count()[['Age','Cabin']]

        Age  Cabin
Pclass
1       186    176
2       173     16
3       355     12

In [19]:
# idx의 연습
titan_df.rename(columns={'Sex': 'Gender'}) # 결과값 안 바뀜 -> 쥬피터에서 결과값 출력 O
titan_df.rename(columns={'Sex' : 'Gender'}, inplace=True) # 결과값 바뀜 -> 쥬피터 결과값 출력X

In [24]:
titan_df['Name_len'] = [len(i) for i in titan_df.Name]
titan_df['Name_len']

0      23
1      51
2      22
3      44
4      24
       ..
886    21
887    28
888    40
889    21
890    19
Name: Name_len, Length: 891, dtype: int64

In [35]:
titan_df['Name_len2']=titan_df['Name'].apply(lambda x : len(x))

In [36]:
titan_df['Name_len2']

0      23
1      51
2      22
3      44
4      24
       ..
886    21
887    28
888    40
889    21
890    19
Name: Name_len2, Length: 891, dtype: int64